# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
brew 'autoconf'
brew 'automake'
brew 'git'
brew 'gnupg2'
brew 'hey'
brew 'hub'
brew 'htop'
brew 'kubernetes-cli'
brew 'libcoap' # Needed for IKEA TRÅDFRI lights
brew 'mackup'
brew 'mas' # Mac App Store Installer
brew 'pkg-config'
brew 'svn' # Need for font-ibm-plex-mono
brew 'wget'
brew 'xz'

# Development
brew 'ansible'
brew 'php', restart_service: true
brew 'php@7.2'
brew 'php@7.3'
brew 'composer'
brew 'minikube'
brew 'mysql', restart_service: true
brew 'mysql@5.7'
brew 'nginx', restart_service: true
brew 'node@12'
brew 'redis'
brew 'sqlite'
brew 'yarn'

# Apps
cask 'appcleaner'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'font-hack-nerd-font'
cask 'font-ibm-plex-mono'
cask 'google-backup-and-sync'
cask 'jetbrains-toolbox'
cask 'macpass'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'iterm2'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'mailplane'
cask 'sourcetree'
cask 'tinkerwell'
cask 'whatsapp'

# Mac App Store Apps
mas 'Jira', id: 1475897096
