# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'shivammathur/php'

# Binaries
brew 'autoconf'
brew 'automake'
brew 'git'
brew 'gnupg2'
brew 'hey'
brew 'hub'
brew 'htop'
brew 'kubernetes-cli'
brew 'libcoap' # Needed for IKEA TRÅDFRI lights
brew 'mackup'
brew 'mas' # Mac App Store Installer
# brew 'mailhog', restart_service: true # Run via Docker
brew 'pkg-config' # For PHP (imagick)
brew 'svn' # Need for font-ibm-plex-mono
brew 'wget'
brew 'xz'
brew 'imagemagick' # For PHP (imagick)

# Development (binaries)
brew 'shivammathur/php/php@7.2'
brew 'shivammathur/php/php@7.3'
brew 'shivammathur/php/php@7.4'
brew 'shivammathur/php/php@8.0', restart_service: true
brew 'composer'
brew 'minikube'
brew 'mysql@5.7'
brew 'mysql@8.0', restart_service: true
brew 'nginx', restart_service: true
brew 'node@12'
brew 'redis'
brew 'sqlite'

# Apps
cask '1password'
cask 'appcleaner'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'font-hack-nerd-font'
cask 'font-ibm-plex-mono'
cask 'google-backup-and-sync'
cask 'phpstorm'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram'
cask 'visual-studio-code'
cask 'iterm2'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'tinkerwell'
cask 'whatsapp'

# Mac App Store Apps
mas 'Spark', id: 1176895641
